# WK2 Measures of Central Tendency <hr style="border:2.5px solid #126782"></hr>

Name: **Tonie Eduard D. Deocampo** <br>
Course: **CpE2A**

import **pandas** and **numpy**

In [41]:
import pandas as pd
import numpy as np

### Creat a **DataFrame** for "Pizza-prizes"

In [42]:
df = pd.read_csv("Pizza-prices.csv")
df

    Position  New York City  Los Angeles
0          1              1          1.0
1          2              2          2.0
2          3              3          3.0
3          4              3          4.0
4          5              5          5.0
5          6              6          6.0
6          7              7          7.0
7          8              8          8.0
8          9              9          9.0
9         10             11         10.0
10        11             66          NaN

Display a **concise summary** of the DataFrame

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Position       11 non-null     int64
 1   New York City  11 non-null     int64
 2   Los Angeles    10 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 396.0 bytes

Display **summary statistics**

In [44]:
df.describe()

        Position  New York City  Los Angeles
count  11.000000      11.000000     10.00000
mean    6.000000      11.000000      5.50000
std     3.316625      18.504054      3.02765
min     1.000000       1.000000      1.00000
25%     3.500000       3.000000      3.25000
50%     6.000000       6.000000      5.50000
75%     8.500000       8.500000      7.75000
max    11.000000      66.000000     10.00000

## New York City

Display the **mean** of New York Pizza prices

In [45]:
ny_mean = df['New York City'].mean()
print (ny_mean)

11.0

Display the data type of  **ny_mean**

In [46]:
type(ny_mean)

numpy.float64

Display the **median** of New York City Pizza Prices

In [47]:
ny_median = df['New York City'].median()
print ("Median = " + str(ny_median))

Median = 6.0

Display the data type of **ny_median**

In [48]:
type(ny_median)

numpy.float64

Display the **mode** of New York City Pizza Prices

In [49]:
ny_mode = df['New York City'].mode()
ny_mode

0    3
Name: New York City, dtype: int64

In [50]:
type(ny_mode)

pandas.core.series.Series

Convert ny_mode to **Numpy Array** then retrieve the **first index** value

In [51]:
ny_mode = df['New York City'].mode().to_numpy()[0]
print("Mode = " + str(ny_mode))

Mode = 3

Display the data type of **ny_mode**

In [52]:
type(ny_mode)

numpy.int64

## Los Angeles

Display the **mean** of Los Angeles Pizza Prices

In [53]:
la_mean = df['Los Angeles'].mean()
print("Mean = $" + str(la_mean))

Mean = $5.5

Display the **median** of Los Angeles Pizza Prices

In [55]:
la_median = df['Los Angeles'].median()
print("Median = $" + str(la_median))

Median = $5.5

Display the **mode** of Los Angeles Pizza Prices

In [56]:
la_mode = df['Los Angeles'].mode()
la_mode

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
Name: Los Angeles, dtype: float64

Display tge **length** of "Los Angeles" column and la_mode (Dont Forget to drop NAN value)

In [57]:
len(df['Los Angeles'].dropna())

10

In [58]:
len(la_mode)

10

Equal lengths indicate each elements has the same frequency (**No Mode**)

In [61]:
if len(df['Los Angeles'].dropna()) == len(la_mode):
    print("No Mode")

No Mode

Apply same **condition** to New York City Mode

In [69]:
ny_mode = df['New York City'].mode().dropna()

if len(df['Los Angeles'].dropna()) == len(ny_mode):
    print("No Mode")

else:
    print("There is a Mode")
    ny_mode = ny_mode.to_numpy()[0]
    print("Mode = $" + str(ny_mode))

There is a Mode
Mode = $3